InformationRegisters/СистемыНалогообложенияОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СистемыНалогообложенияОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СистемаНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СистемыНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяПатент</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОбъектНалогообложения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОбъектовНалогообложения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикТорговыйСбор</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РозничнаяПродажаАлкоголя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПовышеннаяСтавкаНалога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПрименяетсяАУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикЕНП</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлательщикНДСПрименяющийУСН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccountingRegisters/Управленческий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<AccountingRegister>
		<Properties>
			<Name>Управленческий</Name>
			<ChartOfAccounts>ChartOfAccounts.Управленческий</ChartOfAccounts>
			<Correspondence>true</Correspondence>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СценарийПланирования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СценарииПланирования</v8:Type>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Dimension>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВал</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>true</Balance>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаВалИнт</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
					<Balance>false</Balance>
					<AccountingFlag>ChartOfAccounts.Управленческий.AccountingFlag.Валютный</AccountingFlag>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Содержание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</AccountingRegister>
</MetaDataObject>

InformationRegisters/ИсключенияКонтроляОстатковВРознице.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>ИсключенияКонтроляОстатковВРознице</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
						<v8:Type>cfg:CatalogRef.КатегорииНоменклатуры</v8:Type>
						<v8:Type>cfg:CatalogRef.ЦеновыеГруппы</v8:Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоставСегментаНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<InformationRegister>
		<Properties>
			<Name>СоставСегментаНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СегментДляСписка</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РеквизитыДляСписка</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сегмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СпособДобавления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыДобавленияВСегмент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВариантыОграниченийСкидокПоНоменклатуре.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ВариантыОграниченийСкидокПоНоменклатуре</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоНоменклатуре</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоКатегориям</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоЦеновымГруппам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоСегменту</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСтруктурныхЕдиниц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Enum>
		<Properties>
			<Name>ТипыСтруктурныхЕдиниц</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Склад</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Розница</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозницаСуммовойУчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МагазинГруппаСкладов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подразделение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/СтраныМира.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.19">
	<Catalog>
		<Properties>
			<Name>СтраныМира</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАльфа2</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодАльфа3</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчастникЕАЭС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МеждународноеНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПроведениеДокументовУНФ/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Обработчик события ПередЗаписью документов при проведении.
//
// Параметры:
//  Объект - ДокументОбъект
//  Отказ - Булево
//  РежимЗаписи - РежимЗаписиДокумента
//  РежимПроведения -РежимПроведенияДокумента
//
Процедура ПередЗаписью(Объект, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Объект.ДополнительныеСвойства.Вставить("ДляПроведения", Новый Структура);
	Объект.ДополнительныеСвойства.ДляПроведения.Вставить("ЭтоНовый", Объект.ЭтоНовый());
	
КонецПроцедуры

// Инициализирует дополнительные свойства для проведения документа.
// 
// Параметры:
// 	ДокументСсылка - ДокументСсылка - ссылка на проводимый документ.
// 	ДополнительныеСвойства - Структура - описание полей смотри в комментариях в теле процедуры.
Процедура ИнициализироватьДополнительныеСвойстваДляПроведения(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	// В структуре "ДополнительныеСвойства" создаются свойства с ключами "ТаблицыДляДвижений", "ДляПроведения",
	// "УчетнаяПолитика".
	
	// "ТаблицыДляДвижений" - структура, которая будет содержать таблицы значений с данными для выполнения движений.
	ДополнительныеСвойства.Вставить("ТаблицыДляДвижений", Новый Структура);
	
	// "ДляПроведения" - структура, содержащая свойства и реквизиты документа, необходимые для проведения.
	Если Не ДополнительныеСвойства.Свойство("ДляПроведения") Тогда
		ДополнительныеСвойства.Вставить("ДляПроведения", Новый Структура);
	КонецЕсли;
	
	// Структура с ключом "МенеджерВременныхТаблиц", в значении которого хранится менеджер временных таблиц.
	// Содержит для каждой временной таблицы ключ - имя временной таблицы
	// и значение - признак наличия записей во временной таблице.
	ДополнительныеСвойства.ДляПроведения.Вставить("СтруктураВременныеТаблицы",
		Новый Структура("МенеджерВременныхТаблиц", Новый МенеджерВременныхТаблиц));
	ДополнительныеСвойства.ДляПроведения.Вставить("МетаданныеДокумента", ДокументСсылка.Метаданные());
	
	ЗаполнитьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства);
	
	// Определение и установка значения момента, на который должен быть выполнен контроль документа.
	ДополнительныеСвойства.ДляПроведения.Вставить("МоментКонтроля", '00010101');
	ДополнительныеСвойства.ДляПроведения.Вставить("ПериодКонтроля", '39991231');
		
	// Установка организации в случае ведения учета по компании.
	ДополнительныеСвойства.ДляПроведения.Организация = Константы.УчетПоКомпании.Компания(
		ДополнительныеСвойства.ДляПроведения.Организация);
	
	ЗаполнитьУчетнуюПолитику(ДополнительныеСвойства);
	
	// Данные по учету подарочных сертификатов
	ДополнительныеСвойства.Вставить("ДляСертификатов", СтруктураДляСертификатов());
	
	Если ПолучитьФункциональнуюОпцию("ИспользоватьПодарочныеСертификаты") Тогда
		КонтрагентДляПредоплаты = Константы.КонтрагентДляПодарочныхСертификатов.Получить();
		ДополнительныеСвойства.ДляСертификатов.Вставить("КонтрагентДляПредоплаты", КонтрагентДляПредоплаты);
		ДополнительныеСвойства.ДляСертификатов.Вставить("ДоговорПоУмолчанию",
			Справочники.ДоговорыКонтрагентов.ДоговорПоУмолчанию(КонтрагентДляПредоплаты));
		ДополнительныеСвойства.ДляСертификатов.Вставить("СчетУчетаАвансовПокупателя",
			ОбщегоНазначения.ЗначениеРеквизитаОбъекта(КонтрагентДляПредоплаты, "СчетУчетаАвансовПокупателя"));
	КонецЕсли;
	
	// Данные по мультивалютному учету
	ДополнительныеСвойства.Вставить("УчетВалютныхОпераций", ПолучитьФункциональнуюОпцию("УчетВалютныхОпераций"));
	ДополнительныеСвойства.Вставить("ВалютаУчета", Константы.ВалютаУчета.Получить());
	ПроверитьЗаполненностьСвойства("ВалютаУчета", ДополнительныеСвойства);
	ДополнительныеСвойства.Вставить("НациональнаяВалюта", Константы.НациональнаяВалюта.Получить());
	ПроверитьЗаполненностьСвойства("НациональнаяВалюта", ДополнительныеСвойства);
	
	// Данные по системе налогооблажения
	ДополнительныеСвойства.Вставить("СистемаНалогообложенияОрганизации",
	РегистрыСведений.СистемыНалогообложенияОрганизаций.ОпределитьСистемуНалогообложенияОрганизации(
	ДополнительныеСвойства.ДляПроведения.Организация, ТекущаяДатаСеанса()));
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаРеализации")
		Или ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.КорректировкаПоступления") Тогда
		ВариантОсвобожденияАванса = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ВариантОсвобожденияАванса");
		ОсвобождатьАванс = ЗначениеЗаполнено(ВариантОсвобожденияАванса);
		ДополнительныеСвойства.ДляПроведения.Вставить("ОсвобождатьАванс", ОсвобождатьАванс);
	КонецЕсли;
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		ОстаткиЗапасовНеИспользуются = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДокументСсылка, "ОстаткиЗапасовНеИспользуются");
		ДополнительныеСвойства.ДляПроведения.Вставить("ОстаткиЗапасовНеИспользуются", ОстаткиЗапасовНеИспользуются);
	КонецЕсли;
	
КонецПроцедуры

// Подготавливает таблицу для движений по регистру бухгалтерии "Управленческий".
// 
// Параметры:
// 	ДокументСсылка - ДокументСсылка - ссылка на проводимый документ,
// 	ДополнительныеСвойства - Структура - поле "ДополнительныеСвойства" проводимого документа.
Процедура СформироватьТаблицуПроводок(ДокументСсылка, ДополнительныеСвойства) Экспорт
	
	ТаблицаУправленческий = Новый ТаблицаЗначений;
	
	ТаблицаУправленческий.Колонки.Добавить("НомерСтроки");
	ТаблицаУправленческий.Колонки.Добавить("Период");
	ТаблицаУправленческий.Колонки.Добавить("Организация");
	ТаблицаУправленческий.Колонки.Добавить("СценарийПланирования");
	ТаблицаУправленческий.Колонки.Добавить("СчетДт");
	ТаблицаУправленческий.Колонки.Добавить("ВалютаДт");
	ТаблицаУправленческий.Колонки.Добавить("СуммаВалДт");
	ТаблицаУправленческий.Колонки.Добавить("СчетКт");
	ТаблицаУправленческий.Колонки.Добавить("ВалютаКт");
	ТаблицаУправленческий.Колонки.Добавить("СуммаВалКт");
	ТаблицаУправленческий.Колонки.Добавить("Сумма");
	ТаблицаУправленческий.Колонки.Добавить("Содержание");
	
	ДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаУправленческий", ТаблицаУправленческий);
	
КонецПроцедуры

// Выполняет подготовку наборов записей документа.
// 
// Параметры:
// 	ДокументОбъект - ДокументОбъект - документ, для которого подготавливаются наборы записей.
Процедура ПодготовитьНаборыЗаписейКРегистрацииДвижений(ДокументОбъект) Экспорт
	
	Для каждого НаборЗаписей Из ДокументОбъект.Движения Цикл
		
		Если ТипЗнч(НаборЗаписей) = Тип("КлючИЗначение") Тогда
			
			НаборЗаписей = НаборЗаписей.Значение;
			
		КонецЕсли;
		
		Если НаборЗаписей.Количество() > 0 Тогда
			
			НаборЗаписей.Очистить();
			
		КонецЕсли;
		
	КонецЦикла;
	
	ЭтоНовый = Неопределено;
	Если ДокументОбъект.ДополнительныеСвойства.ДляПроведения.Свойство("ЭтоНовый") Тогда
		ЭтоНовый = ДокументОбъект.ДополнительныеСвойства.ДляПроведения.ЭтоНовый;
	КонецЕсли;
	
	Если ЭтоНовый <> Истина Тогда
		ИменаИспользуемыхРегистров = ИменаИспользуемыхРегистров(ДокументОбъект.Ссылка,
			ДокументОбъект.ДополнительныеСвойства.ДляПроведения.МетаданныеДокумента);
		
		Для Каждого ИмяРегистра Из ИменаИспользуемыхРегистров Цикл
			ДокументОбъект.Движения[ИмяРегистра].Записывать = Истина;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

// Записывает наборы записей документа.
// 
// Параметры:
// 	ДокументОбъект - ДокументОбъект - документ, для которого записываются наборы записей.
Процедура ЗаписатьНаборыЗаписей(ДокументОбъект) Экспорт
	
	Для каждого НаборЗаписей Из ДокументОбъект.Движения Цикл
		
		Если ТипЗнч(НаборЗаписей) = Тип("КлючИЗначение") Тогда
			
			НаборЗаписей = НаборЗаписей.Значение;
			
		КонецЕсли;
		
		Если НаборЗаписей.Записывать Тогда
			
			Если НЕ НаборЗаписей.ДополнительныеСвойства.Свойство("ДляПроведения") Тогда
				
				НаборЗаписей.ДополнительныеСвойства.Вставить("ДляПроведения", Новый Структура);
				
			КонецЕсли;
			
			Если НЕ НаборЗаписей.ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
				
				НаборЗаписей.ДополнительныеСвойства.ДляПроведения.Вставить("СтруктураВременныеТаблицы",
					ДокументОбъект.ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы);
				Если ДокументОбъект.ДополнительныеСвойства.Свойство("РежимЗаписи") Тогда
					НаборЗаписей.ДополнительныеСвойства.ДляПроведения.Вставить("РежимЗаписи",
						ДокументОбъект.ДополнительныеСвойства.РежимЗаписи);
				КонецЕсли;
			КонецЕсли;
			
			НаборЗаписей.Записать();
			НаборЗаписей.Записывать = Ложь;
			
		Иначе
			
			МетаданныеРегистра = НаборЗаписей.Метаданные();
			Если ОбщегоНазначения.ЭтоРегистрНакопления(МетаданныеРегистра)
				И ЕстьПроцедураСоздатьПустуюВременнуюТаблицуИзменение(МетаданныеРегистра) Тогда
				
				МенеджерОбъекта = ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(МетаданныеРегистра.ПолноеИмя());
				//@skip-warning см. ЕстьПроцедураСоздатьПустуюВременнуюТаблицуИзменение 
				МенеджерОбъекта.СоздатьПустуюВременнуюТаблицуИзменение(ДокументОбъект.ДополнительныеСвойства);
				
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

// Возвращает истинное значение, когда в информационной базе отключен контроль остатков при проведении.
// 
// Возвращаемое значение:
//  Булево - в информационной базе выключен контроль остатков при проведении.
Функция КонтрольОстатковВыключен() Экспорт
	Возврат Не Константы.КонтролироватьОстаткиПриПроведении.Получить();
КонецФункции

// Записывает движения указанного регистра из таблицы для движений
// 
// Параметры:
// 	ИмяРегистра - Строка - имя регистра,
// 	ТаблицыДляДвижений - Структура - таблицы для движений,
// 	Движения - КоллекцияДвижений - коллекция движений проводимого документа,
// 	Отказ - Булево - признак "Отказ".
Процедура ОтразитьДвижения(ИмяРегистра, ТаблицыДляДвижений, Движения, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТаблицы = СтрШаблон("Таблица%1", ИмяРегистра);
	
	Если ТаблицыДляДвижений[ИмяТаблицы].Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения[ИмяРегистра].Записывать = Истина;
	Движения[ИмяРегистра].Загрузить(ТаблицыДляДвижений[ИмяТаблицы]);
	
КонецПроцедуры

// Выполняет движения регистра бухгалтерии Управленческий.
// 
// Параметры:
// 	ДополнительныеСвойства - Структура - поле "ДополнительныеСвойства" проводимого документа.
// 	Движения - КоллекцияДвижений - коллекция движений проводимого документа,
// 	Отказ - Булево - признак "Отказ".
Процедура ОтразитьУправленческий(ДополнительныеСвойства, Движения, Отказ) Экспорт
	
	ПроверитьОграничениеБазовойВерсии(Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ТаблицаУправленческий = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУправленческий;
	
	Если ТаблицаУправленческий.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Движения.Управленческий.Записывать = Истина;
	
	Для каждого СтрокаТаблицаУправленческий Из ТаблицаУправленческий Цикл
		ДвижениеУправленческий = Движения.Управленческий.Добавить();
		ЗаполнитьЗначенияСвойств(ДвижениеУправленческий, СтрокаТаблицаУправленческий);
	КонецЦикла;
	
КонецПроцедуры

// Закрывает менеджер временных таблиц, который использовался для формирования движений документа.
// 
// Параметры:
// 	ДокументОбъект - ДокументОбъект - документ, для которого закрывается менеджер временных таблиц.
Процедура ЗакрытьМенеджерВременныхТаблиц(ДокументОбъект) Экспорт
	ДокументОбъект.ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц.Закрыть();
КонецПроцедуры

// Формирует временные таблицы исключений для контроля остатков:
//  СкладыБезКонтроля - Склады на которых вообще не выполняется контроль остатков в рознице
//  НоменклатураСкладыБезКонтроля - Сочетания номенклатура/склад, по которым не выполняется контроль
//
// Параметры:
//  МенеджерВременныхТаблиц - МенеджерВременныхТаблиц
//
Процедура ПодготовитьВременныеТаблицыИсключенийКонтроляОстатков(МенеджерВременныхТаблиц) Экспорт
	
	ВариантИсключений = Константы.ВариантИсключенийКонтроляОстатковВРознице.Получить();
	
	ВременнаяТаблица = ПолучитьВременнуюТаблицуДляНоменклатуры(МенеджерВременныхТаблиц);
	Если ВременнаяТаблица = Неопределено Тогда
		ПодготовитьПустуюТаблицуИсключений(МенеджерВременныхТаблиц);
		Возврат;
	КонецЕсли;
	
	Если Не РегистрыСведений.ИсключенияКонтроляОстатковВРознице.ЕстьНастройкиИсключений() Тогда
		ПодготовитьПустуюТаблицуИсключений(МенеджерВременныхТаблиц);
		Возврат;
	КонецЕсли;
	
	ТаблицаНоменклатуры = ВременнаяТаблица.ПолучитьДанные().Выгрузить().Скопировать(, "Номенклатура");
	ТаблицаОбъектовКонтроля = ТаблицаНоменклатуры.СкопироватьКолонки();
	ОписаниеТипа = ОпределитьОписаниеТипаПоВариантуИсключений(ВариантИсключений);
	Если Не ЗначениеЗаполнено(ОписаниеТипа) Тогда
		ПодготовитьПустуюТаблицуИсключений(МенеджерВременныхТаблиц);
		Возврат;
	КонецЕсли;
	ТаблицаОбъектовКонтроля.Колонки.Добавить("Объект", Новый ОписаниеТипов(ОписаниеТипа));
	
	Для Каждого СтрокаНоменклатуры Из ТаблицаНоменклатуры Цикл
		ВерхнийУровень = Ложь;
		НоваяСтрока = ТаблицаОбъектовКонтроля.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаНоменклатуры);
		ЗаполнитьОбъектПоСтроке(НоваяСтрока, ВариантИсключений, ВерхнийУровень);
		Пока Не ВерхнийУровень Цикл
			ПредыдущаяСтрока = НоваяСтрока;
			НоваяСтрока = ТаблицаОбъектовКонтроля.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, ПредыдущаяСтрока);
			ЗаполнитьОбъектПоСтроке(НоваяСтрока, ВариантИсключений, ВерхнийУровень);
		КонецЦикла;
	КонецЦикла;
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаОбъектовКонтроля.Номенклатура КАК Номенклатура,
	|	ТаблицаОбъектовКонтроля.Объект КАК Объект
	|ПОМЕСТИТЬ ТаблицаОбъектовКонтроля
	|ИЗ
	|	&ТаблицаОбъектовКонтроля КАК ТаблицаОбъектовКонтроля
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ИсключенияКонтроляОстатковВРознице.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ СкладыБезКонтроля
	|ИЗ
	|	РегистрСведений.ИсключенияКонтроляОстатковВРознице КАК ИсключенияКонтроляОстатковВРознице
	|ГДЕ
	|	ИсключенияКонтроляОстатковВРознице.Номенклатура В (НЕОПРЕДЕЛЕНО, ЗНАЧЕНИЕ(Справочник.КатегорииНоменклатуры.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.ЦеновыеГруппы.ПустаяСсылка), ЗНАЧЕНИЕ(Справочник.СегментыНоменклатуры.ПустаяСсылка))
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсключенияКонтроляОстатковВРознице.СтруктурнаяЕдиница
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ТаблицаОбъектовКонтроля.Номенклатура КАК Номенклатура,
	|	ИсключенияКонтроляОстатковВРознице.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ НоменклатураБезКонтроля
	|ИЗ
	|	РегистрСведений.ИсключенияКонтроляОстатковВРознице КАК ИсключенияКонтроляОстатковВРознице
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовКонтроля КАК ТаблицаОбъектовКонтроля
	|		ПО (ИсключенияКонтроляОстатковВРознице.Номенклатура = ТаблицаОбъектовКонтроля.Номенклатура
	|				ИЛИ ИсключенияКонтроляОстатковВРознице.Номенклатура = ТаблицаОбъектовКонтроля.Объект)
	|			И (&ВариантИсключений = ЗНАЧЕНИЕ(Перечисление.ВариантыОграниченийСкидокПоНоменклатуре.ПоНоменклатуре))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОбъектовКонтроля.Номенклатура,
	|	ИсключенияКонтроляОстатковВРознице.СтруктурнаяЕдиница
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОбъектовКонтроля.Номенклатура,
	|	ИсключенияКонтроляОстатковВРознице.СтруктурнаяЕдиница
	|ИЗ
	|	РегистрСведений.ИсключенияКонтроляОстатковВРознице КАК ИсключенияКонтроляОстатковВРознице
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовКонтроля КАК ТаблицаОбъектовКонтроля
	|		ПО ИсключенияКонтроляОстатковВРознице.Номенклатура = ТаблицаОбъектовКонтроля.Объект
	|			И (&ВариантИсключений = ЗНАЧЕНИЕ(Перечисление.ВариантыОграниченийСкидокПоНоменклатуре.ПоКатегориям))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОбъектовКонтроля.Номенклатура,
	|	ИсключенияКонтроляОстатковВРознице.СтруктурнаяЕдиница
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОбъектовКонтроля.Номенклатура,
	|	ИсключенияКонтроляОстатковВРознице.СтруктурнаяЕдиница
	|ИЗ
	|	РегистрСведений.ИсключенияКонтроляОстатковВРознице КАК ИсключенияКонтроляОстатковВРознице
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ТаблицаОбъектовКонтроля КАК ТаблицаОбъектовКонтроля
	|		ПО ИсключенияКонтроляОстатковВРознице.Номенклатура = ТаблицаОбъектовКонтроля.Объект
	|			И (&ВариантИсключений = ЗНАЧЕНИЕ(Перечисление.ВариантыОграниченийСкидокПоНоменклатуре.ПоЦеновымГруппам))
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОбъектовКонтроля.Номенклатура,
	|	ИсключенияКонтроляОстатковВРознице.СтруктурнаяЕдиница
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Номенклатура,
	|	ИсключенияКонтроляОстатковВРознице.СтруктурнаяЕдиница
	|ИЗ
	|	РегистрСведений.ИсключенияКонтроляОстатковВРознице КАК ИсключенияКонтроляОстатковВРознице,
	|	(ВЫБРАТЬ
	|		ТаблицаОбъектовКонтроля.Номенклатура КАК Номенклатура,
	|		СоставСегментаНоменклатуры.Сегмент КАК Объект
	|	ИЗ
	|		ТаблицаОбъектовКонтроля КАК ТаблицаОбъектовКонтроля
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоставСегментаНоменклатуры КАК СоставСегментаНоменклатуры
	|			ПО ТаблицаОбъектовКонтроля.Номенклатура = СоставСегментаНоменклатуры.Номенклатура) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ИсключенияКонтроляОстатковВРознице.СтруктурнаяЕдиница,
	|	ВложенныйЗапрос.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	НоменклатураБезКонтроля.Номенклатура КАК Номенклатура,
	|	СтруктурныеЕдиницы.Ссылка КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ НоменклатураСкладыБезКонтроля
	|ИЗ
	|	НоменклатураБезКонтроля КАК НоменклатураБезКонтроля
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СтруктурныеЕдиницы
	|		ПО (НоменклатураБезКонтроля.СтруктурнаяЕдиница = СтруктурныеЕдиницы.Ссылка
	|				ИЛИ НоменклатураБезКонтроля.СтруктурнаяЕдиница = ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка))
	|			И (СтруктурныеЕдиницы.ТипСтруктурнойЕдиницы В (ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Склад), ЗНАЧЕНИЕ(Перечисление.ТипыСтруктурныхЕдиниц.Розница)))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ ТаблицаОбъектовКонтроля
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|УНИЧТОЖИТЬ НоменклатураБезКонтроля");
	Запрос.УстановитьПараметр("ТаблицаОбъектовКонтроля", ТаблицаОбъектовКонтроля);
	Запрос.УстановитьПараметр("ВариантИсключений", ВариантИсключений);
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	
	Запрос.Выполнить();
	
КонецПроцедуры

// Дополняет таблицу движений обратными движениями
//
// Параметры:
//  ТаблицаДвижений - ТаблицаЗначений - Таблица движений для дополнения
//  ДополнительныеПараметры - Структура - Структура дополнительных параметров
//
Процедура ДополнитьТаблицуОбратнымиДвижениями(ТаблицаДвижений, ДополнительныеПараметры = Неопределено) Экспорт
	
	ИсходнаяТаблица = ТаблицаДвижений.Скопировать();
	
	Для Каждого СтрокаИсходнойТаблицы Из ИсходнаяТаблица Цикл
		
		НоваяСтрока = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаИсходнойТаблицы);
		
		НоваяСтрока.ВидДвижения = ?(СтрокаИсходнойТаблицы.ВидДвижения = ВидДвиженияНакопления.Приход, ВидДвиженияНакопления.Расход, ВидДвиженияНакопления.Приход);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Проверяет заполненность свойства для проведения документа.
// Многие алгоритмы проведения полагаются на то, что данные свойства заполнены.
// Без заполнения этих свойств пользователь может получать неинформативные сообщения об ошибках.
//
// Параметры:
//  ИмяСвойства - Строка - имя свойства
//  Свойства - Структура - дополнительные свойства документа
//
Процедура ПроверитьЗаполненностьСвойства(ИмяСвойства, Свойства)
	
	Если ЗначениеЗаполнено(Свойства[ИмяСвойства]) Тогда
		Возврат;
	КонецЕсли;
	
	ТекстСообщения = СтрШаблон("Не заполнено обязательное свойство ""%1"" для проведения документа.", ИмяСвойства);
	ВызватьИсключение ТекстСообщения;
	
КонецПроцедуры

Функция ПолучитьВременнуюТаблицуДляНоменклатуры(МенеджерВременныхТаблиц)
	
	ВременнаяТаблица = МенеджерВременныхТаблиц.Таблицы.Найти("ВременнаяТаблицаЗапасы");
	Если ВременнаяТаблица <> Неопределено Тогда
		Возврат ВременнаяТаблица;
	КонецЕсли;
	
	ВременнаяТаблица = МенеджерВременныхТаблиц.Таблицы.Найти("ВТДвиженияЗапасыИзменение");
	Возврат ВременнаяТаблица;
	
КонецФункции

Функция СтруктураДляСертификатов()
	
	СтруктураДляСертификатов = Новый Структура;
	
	СтруктураДляСертификатов.Вставить("КонтрагентДляПредоплаты");
	СтруктураДляСертификатов.Вставить("ДоговорПоУмолчанию");
	СтруктураДляСертификатов.Вставить("СчетУчетаАвансовПокупателя");
	
	Возврат СтруктураДляСертификатов;
	
КонецФункции

Процедура ЗаполнитьДанныеДокумента(ДокументСсылка, ДополнительныеСвойства)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ТаблицаДокумента.Ссылка КАК Ссылка,
	|	ТаблицаДокумента.Номер КАК Номер,
	|	ТаблицаДокумента.Дата КАК Дата,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК Организация,
	|	ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка) КАК ОрганизацияДляРегОтчетности,
	|	ТаблицаДокумента.МоментВремени КАК МоментВремени,
	|	НЕОПРЕДЕЛЕНО КАК ВидОперации,
	|	ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка) КАК СтранаРегистрации,
	|	ТаблицаДокумента.Представление КАК Представление
	|ИЗ
	|	&ИмяТаблицыДокумента КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &ДокументСсылка");
	
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Организация", ДополнительныеСвойства.ДляПроведения.МетаданныеДокумента) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)",
			"ТаблицаДокумента.Организация");
	КонецЕсли;
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("ВидОперации", ДополнительныеСвойства.ДляПроведения.МетаданныеДокумента) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "НЕОПРЕДЕЛЕНО КАК ВидОперации",
			"ТаблицаДокумента.ВидОперации КАК ВидОперации");
	КонецЕсли; 
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная")
		Или ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "ЗНАЧЕНИЕ(Справочник.СтраныМира.ПустаяСсылка)",
			"ТаблицаДокумента.Контрагент.СтранаРегистрации");
	КонецЕсли;
	
	ИмяТаблицыДокумента = ОбщегоНазначения.ИмяТаблицыПоСсылке(ДокументСсылка);
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&ИмяТаблицыДокумента", ИмяТаблицыДокумента);
	
	Запрос.УстановитьПараметр("ДокументСсылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	// Формирование ключей, содержащих данные документа.
	Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
		ДополнительныеСвойства.ДляПроведения.Вставить(Колонка.Имя);
	КонецЦикла;
	
	ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаИзРезультатаЗапроса.Следующий();
	
	// Заполнение значений для ключей, содержащих данные документа.
	ЗаполнитьЗначенияСвойств(ДополнительныеСвойства.ДляПроведения, ВыборкаИзРезультатаЗапроса);
	
	ЗаполнитьДанныеПриходнойНакладной(ДокументСсылка, ДополнительныеСвойства, ВыборкаИзРезультатаЗапроса);
	
КонецПроцедуры

Процедура ЗаполнитьДанныеПриходнойНакладной(ДокументСсылка, ДополнительныеСвойства, ВыборкаИзРезультатаЗапроса)
	
	Если ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.ПриходнаяНакладная")
		Или ТипЗнч(ДокументСсылка) = Тип("ДокументСсылка.РасходнаяНакладная")Тогда
		
		ДополнительныеСвойства.ДляПроведения.Вставить(
			"ЭтоКонтрагентИзЕАЭС",
			ПрослеживаемостьУНФ.ГосударствоЧленТаможенногоСоюза(ВыборкаИзРезультатаЗапроса.СтранаРегистрации));
		
	Иначе
		Возврат;
	КонецЕсли;
	
КонецПроцедуры

// Заполняет свойство "УчетнаяПолитика", содержащее значения всех параметров учетной политики
// на момент времени документа и по выбранной в документе организации
// или по компании (в случае ведения учета по компании).
Процедура ЗаполнитьУчетнуюПолитику(ДополнительныеСвойства)
	
	ДополнительныеСвойства.Вставить("УчетнаяПолитика", Новый Структура);
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	Константы.ФункциональнаяОпцияРезервированиеЗапасов КАК РезервированиеЗапасов,
	|	Константы.ФункциональнаяОпцияУчетПоПроектам КАК УчетПоПроектам,
	|	Константы.ФункциональнаяОпцияУчетПоЯчейкам КАК УчетПоЯчейкам,
	|	Константы.ФункциональнаяОпцияКассовыйМетодУчетаДоходовИРасходов КАК КассовыйМетодУчетаДоходовИРасходов,
	|	Константы.ФункциональнаяОпцияИспользоватьПартии КАК ИспользоватьПартии,
	|	Константы.ФункциональнаяОпцияИспользоватьХарактеристики КАК ИспользоватьХарактеристики,
	|	Константы.ФункциональнаяОпцияИспользоватьТехоперации КАК ИспользоватьТехоперации,
	|	Константы.ФункциональнаяОпцияИспользоватьЭтапыПроизводства КАК ИспользоватьЭтапыПроизводства,
	|	Константы.ИспользоватьСерииНоменклатуры КАК ИспользоватьСерииНоменклатуры,
	|	Константы.КонтрольОстатковСерийНоменклатуры КАК ОстаткиСерийНоменклатуры,
	|	Константы.ФункциональнаяОпцияИспользоватьПодарочныеСертификаты КАК ИспользоватьПодарочныеСертификаты,
	|	Константы.ФункциональнаяОпцияИспользоватьЧастичноеПогашениеСертификатов КАК ИспользоватьЧастичноеПогашениеСертификатов,
	|	Константы.ФункциональнаяОпцияРазрешитьСкладыВТабличныхЧастях КАК РазрешитьСкладыВТабличныхЧастях,
	|	Константы.ПередачаТоваровМеждуОрганизациями КАК ПередачаТоваровМеждуОрганизациями,
	|	Константы.ВестиУчетПрослеживаемыхТоваров КАК ВестиУчетПрослеживаемыхТоваров
	|ИЗ
	|	Константы КАК Константы");
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Для каждого Колонка Из РезультатЗапроса.Колонки Цикл
		ДополнительныеСвойства.УчетнаяПолитика.Вставить(Колонка.Имя);
	КонецЦикла;
	
	ВыборкаИзРезультатаЗапроса = РезультатЗапроса.Выбрать();
	ВыборкаИзРезультатаЗапроса.Следующий();
	
	ЗаполнитьЗначенияСвойств(ДополнительныеСвойства.УчетнаяПолитика, ВыборкаИзРезультатаЗапроса);
	
КонецПроцедуры

// Возвращает имена регистров, по которым есть движения документа.
// 
// Параметры:
// 	Регистратор - ДокументСсылка - ссылка на документ,
// 	МетаданныеДокумента - ОбъектМетаданных - объект метаданных.
// Возвращаемое значение:
// 	Массив из Строка - имена регистров, по которым есть движения документа. 
Функция ИменаИспользуемыхРегистров(Регистратор, МетаданныеДокумента)

	Результат = Новый Массив;
	СчетчикЦикла = 0;
	ВсегоРегистров = МетаданныеДокумента.Движения.Количество();
	ЗапросыКДвижениям = Новый Массив;
	ОбъединитьВсе = "
					|ОБЪЕДИНИТЬ ВСЕ
					|";

	Для Каждого Движение Из МетаданныеДокумента.Движения Цикл

		СчетчикЦикла = СчетчикЦикла + 1;

		ТекстЗапросаДвижение = ТекстЗапросаДвижение(Движение.Имя, Движение.ПолноеИмя());
		ЗапросыКДвижениям.Добавить(ТекстЗапросаДвижение);

		Если ЗапросыКДвижениям.Количество() = 256 Или СчетчикЦикла = ВсегоРегистров Тогда

			ТекстЗапроса = СтрСоединить(ЗапросыКДвижениям, ОбъединитьВсе);
			ЗапросыКДвижениям.Очистить();
			Запрос = Новый Запрос(ТекстЗапроса);
			Запрос.УстановитьПараметр("Регистратор", Регистратор);

			//@skip-check query-in-loop - проектное решение, запрос выполняется порциями
			ДополнитьРезультатИменаИспользуемыхРегистров(Результат, Запрос);

		КонецЕсли;

	КонецЦикла;

	Возврат Результат;

КонецФункции

Процедура ДополнитьРезультатИменаИспользуемыхРегистров(Результат, Запрос)

	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.ИмяРегистра);
	КонецЦикла;

КонецПроцедуры

Функция ТекстЗапросаДвижение(ИмяРегистра, ИмяТаблицы)

	Результат = СтрШаблон(
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	""%1"" КАК ИмяРегистра
	|ИЗ
	|	&ИмяТаблицы КАК Т
	|ГДЕ
	|	Т.Регистратор = &Регистратор", ИмяРегистра);

	Возврат СтрЗаменить(Результат, "&ИмяТаблицы", ИмяТаблицы);

КонецФункции

Функция ЕстьПроцедураСоздатьПустуюВременнуюТаблицуИзменение(МетаданныеРегистра)
	
	РегистрыСПроцедурой = Новый Соответствие;
	ОпределитьРегистрыСПроцедуройСоздатьПустуюВременнуюТаблицуИзменение(РегистрыСПроцедурой);
	Возврат РегистрыСПроцедурой[МетаданныеРегистра.Имя] <> Неопределено;
	
КонецФункции

Процедура ПроверитьОграничениеБазовойВерсии(Отказ)
	
	Если Не СтандартныеПодсистемыСервер.ЭтоБазоваяВерсияКонфигурации() Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Организации.Ссылка) КАК КоличествоОрганизаций
						  |ИЗ
						  |	Справочник.Организации КАК Организации");
						  
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.КоличествоОрганизаций > 2 Тогда
			Отказ = Истина;
			ОбщегоНазначения.СообщитьПользователю(НСтр(
					"ru='Ограничение базовой версии: в информационной базе могут быть введены только две организации.'"));
			Возврат;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ОпределитьРегистрыСПроцедуройСоздатьПустуюВременнуюТаблицуИзменение(РегистрыСПроцедурой)
	
	РегистрыСПроцедурой["ВнеоборотныеАктивы"] = Истина;
	РегистрыСПроцедурой["ДенежныеСредства"] = Истина;
	РегистрыСПроцедурой["ДенежныеСредстваВКассахККМ"] = Истина;
	РегистрыСПроцедурой["ДенежныеСредстваКПоступлению"] = Истина;
	РегистрыСПроцедурой["ДоходыИРасходыНераспределенные"] = Истина;
	РегистрыСПроцедурой["ДоходыИРасходыОтложенные"] = Истина;
	РегистрыСПроцедурой["ЗаказыНаПроизводство"] = Истина;
	РегистрыСПроцедурой["ЗаказыПокупателей"] = Истина;
	РегистрыСПроцедурой["ЗаказыПоставщикам"] = Истина;
	РегистрыСПроцедурой["ЗаказыНаПеремещение"] = Истина;
	РегистрыСПроцедурой["Запасы"] = Истина;
	РегистрыСПроцедурой["ЗапасыВРазрезеГТД"] = Истина;
	РегистрыСПроцедурой["ЗапасыПереданныеВРазрезеГТД"] = Истина;
	РегистрыСПроцедурой["ЗапасыПринятыеВРазрезеГТД"] = Истина;
	РегистрыСПроцедурой["ЗапасыКПоступлениюНаСклады"] = Истина;
	РегистрыСПроцедурой["ЗапасыКРасходуСоСкладов"] = Истина;
	РегистрыСПроцедурой["ЗапасыНаСкладах"] = Истина;
	РегистрыСПроцедурой["ЗапасыПереданные"] = Истина;
	РегистрыСПроцедурой["ЗапасыИАгентскиеУслугиПринятые"] = Истина;
	РегистрыСПроцедурой["КнигаУчетаДоходовИРасходов"] = Истина;
	РегистрыСПроцедурой["НДФЛДоходы"] = Истина;
	РегистрыСПроцедурой["НДФЛРасчетыНалоговыхАгентовСБюджетом"] = Истина;
	РегистрыСПроцедурой["ПотребностьВЗапасах"] = Истина;
	РегистрыСПроцедурой["ПримененныеВычетыПоНДФЛ"] = Истина;
	РегистрыСПроцедурой["РазмещениеЗаказов"] = Истина;
	РегистрыСПроцедурой["РасчетыПоНалогам"] = Истина;
	РегистрыСПроцедурой["РасчетыПоЭквайрингу"] = Истина;
	РегистрыСПроцедурой["РасчетыСПерсоналом"] = Истина;
	РегистрыСПроцедурой["РасчетыСПодотчетниками"] = Истина;
	РегистрыСПроцедурой["РасчетыСПокупателями"] = Истина;
	РегистрыСПроцедурой["РасчетыСПоставщиками"] = Истина;
	РегистрыСПроцедурой["РасчетыСФондамиПоСтраховымВзносамУНФ"] = Истина;
	РегистрыСПроцедурой["СтраховыеВзносыДоходы"] = Истина;
	РегистрыСПроцедурой["СтраховыеВзносыПереданныеВПФР"] = Истина;
	РегистрыСПроцедурой["СуммовойУчетВРознице"] = Истина;
	РегистрыСПроцедурой["СерииНоменклатуры"] = Истина;
	РегистрыСПроцедурой["ЗапасыВРемонте"] = Истина;
	РегистрыСПроцедурой["ЗапасыПереданныеВРемонте"] = Истина;
	РегистрыСПроцедурой["ПодарочныеСертификаты"] = Истина;
	РегистрыСПроцедурой["БонусныеБаллы"] = Истина;
	РегистрыСПроцедурой["ДенежныеСредстваВРезерве"] = Истина;
	РегистрыСПроцедурой["ПрослеживаемыеТовары"] = Истина; // Прослеживаемость
	РегистрыСПроцедурой["СерииНоменклатурыКРасходу"] = Истина;
	РегистрыСПроцедурой["СерииНоменклатурыКПоступлению"] = Истина;
	РегистрыСПроцедурой["РезервыТоваровОрганизаций"] = Истина; // Интеркампани
	
КонецПроцедуры

Процедура ЗаполнитьОбъектПоСтроке(НоваяСтрока, ВариантИсключений, ВерхнийУровень)
	
	ИмяКолонки = ?(ЗначениеЗаполнено(НоваяСтрока.Объект), "Объект", "Номенклатура");
	
	Если ВариантИсключений = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоНоменклатуре Тогда
		
		НоваяСтрока.Объект = НоваяСтрока[ИмяКолонки].Родитель;
		Если Не НоваяСтрока.Объект.Пустая() Тогда
			ВерхнийУровень = (НоваяСтрока.Объект.Уровень() = 0);
		Иначе
			ВерхнийУровень = Истина;
		КонецЕсли;
		
	ИначеЕсли ВариантИсключений = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоКатегориям Тогда
		
		Если ИмяКолонки = "Объект" Тогда
			НоваяСтрока.Объект = НоваяСтрока[ИмяКолонки].Родитель;
		Иначе
			НоваяСтрока.Объект = НоваяСтрока[ИмяКолонки].КатегорияНоменклатуры;
		КонецЕсли;
		Если Не НоваяСтрока.Объект.Пустая() Тогда
			ВерхнийУровень = (НоваяСтрока.Объект.Уровень() = 0);
		Иначе
			ВерхнийУровень = Истина;
		КонецЕсли;
		
	ИначеЕсли ВариантИсключений = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоЦеновымГруппам Тогда
		
		НоваяСтрока.Объект = НоваяСтрока[ИмяКолонки].ЦеноваяГруппа;
		ВерхнийУровень = Истина;
		
	ИначеЕсли ВариантИсключений = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоСегменту Тогда
		
		ВерхнийУровень = Истина;
		
	КонецЕсли;
	
КонецПроцедуры

Функция ОпределитьОписаниеТипаПоВариантуИсключений(ВариантИсключений)
	
	Если ВариантИсключений = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоНоменклатуре Тогда
		Возврат "СправочникСсылка.Номенклатура";
	ИначеЕсли ВариантИсключений = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоКатегориям Тогда
		Возврат "СправочникСсылка.КатегорииНоменклатуры";
	ИначеЕсли ВариантИсключений = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоЦеновымГруппам Тогда
		Возврат "СправочникСсылка.ЦеновыеГруппы";
	ИначеЕсли ВариантИсключений = Перечисления.ВариантыОграниченийСкидокПоНоменклатуре.ПоСегменту Тогда
		Возврат "СправочникСсылка.СегментыНоменклатуры";
	Иначе
		Возврат "";
	КонецЕсли;
	
КонецФункции

Процедура ПодготовитьПустуюТаблицуИсключений(МенеджерВременныхТаблиц)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ СкладыБезКонтроля
	|ГДЕ
	|	ЛОЖЬ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НЕОПРЕДЕЛЕНО КАК Номенклатура,
	|	НЕОПРЕДЕЛЕНО КАК СтруктурнаяЕдиница
	|ПОМЕСТИТЬ НоменклатураСкладыБезКонтроля
	|ГДЕ
	|	ЛОЖЬ");
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Выполнить();
	
КонецПроцедуры

#КонецОбласти
